testing/load_test copy.yml
config:
  target: "https://order-juank1400-dev.apps.rm3.7wse.p1.openshiftapps.com"
  phases:
    - name: "Warm-up Phase"
      duration: 180
      arrivalRate: 10   # Start with 10 RPS
    - name: "Spike Load Phase"
      duration: 600    # 30 minutes (1800 seconds)
      arrivalRate: 50  # Maintain 100 RPS
    - name: "Cool-down Phase"
      duration: 120
      arrivalRate: 10   # Ramp down

scenarios:
  - flow:
      - post:
          url: "/orders"
          json:
            userId: "{{ $randomNumber(10000, 100000) }}"  # Random ID between 10,000 and 100,000
            type: "{{ $randomString('buy', 'sell') }}"  # Random "buy" or "sell"
            asset: "{{ $randomString('apl', 'ibm', 'aws') }}"  # Random asset
            quantity: "{{ $randomNumber(1, 50) }}"  # Random quantity between 1 and 50
          headers:
            Content-Type: "application/json"